/*
 * Розгалуження
 *
 * - Інструкція if
 * - Інструкція if...else
 * - Блок else...if
 * - Тернарний оператор
 */

// const score = 10;

// if (score >= 10) {
//   alert('Ви молодець!');
// } else {
//   alert('Потрібно ще попрацювати!');
// }

/*
? Запросіть у користувача число, якщо число дорівнює 10,
? то виведіть 'Вірно', інакше виведіть 'Невірно'.
*/

// const userNumber = Number(prompt('Введіть будь ласка якесь число.'));

// if (userNumber === 10) {
//   alert('Вірно');
// } else {
//   alert('Невірно');
// }

/*
? Перевірте чи є гроші на балансі, якщо є то виведіть до консолі 'Positive', інакше 'Negative'.
*/

// const balance = 1000;

// if (balance > 0) {
//   alert('Positive');
// } else {
//   alert('Negative');
// }

/*
? В залежності від значення в змінній login, потрібно формувати відповідне повідомлення.
? Співробітник - Привіт
? Директор - Вітаю
? '' - Немає логіну
? В інших випадках повідомлення має бути порожнім.
*/

// const login = 'Директор';
// let message;

// if (login === 'Співробітник') {
//   message = 'Привіт';
// } else if (login === 'Директор') {
//   message = 'Вітаю';
// } else if (login === '') {
//   message = 'Немає логіну';
// } else {
//   message = '';
// }

// console.log(message);

/*
? Перепишіть конструкцію if з використанням тернарного оператора.
*/

// const a = 1;
// const b = 1;

// const result = a + b < 4 ? 'Мало' : 'Багато';

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Багато';
// }

// console.log(result);

/*
?  Перепишіть if..else за допомогою декількох тернарних операторів.
*/

// const login = 'Співробітник';
// let message =
//   login === 'Співробітник'
//     ? 'Привіт'
//     : login === 'Директор'
//     ? 'Вітаю'
//     : login === ''
//     ? 'Немає логіну'
//     : '';

// if (login === 'Співробітник') {
//   message = 'Привіт';
// } else if (login === 'Директор') {
//   message = 'Вітаю';
// } else if (login === '') {
//   message = 'Немає логіну';
// } else {
//   message = '';
// }

// console.log(message);
